## Solution 1

In [1]:
import pandas as pd

In [2]:
data = [4,8,15,16,23,42]

In [3]:
ds = pd.Series(data)

In [4]:
ds

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [5]:
type(ds)

pandas.core.series.Series

## Solution 2

In [7]:
import pandas as pd

In [8]:
data1 = [1,2,3,4,5,6,7,8,9,10]

In [9]:
ds1 = pd.Series(data1)

In [10]:
ds1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [11]:
type(ds1)

pandas.core.series.Series

## Solution 3

In [13]:
import pandas as pd

In [14]:
data2 = {'Name':['Alice','Bob','Claire'],'Age':[25,30,27],"Gender":['Female','Male','Female']}

In [15]:
df = pd.DataFrame(data2)

In [16]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [17]:
type(df)

pandas.core.frame.DataFrame

## Solution 4

A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. Pandas DataFrame consists of three principal components, the data, rows, and columns.

Series can only contain single list with index, whereas dataframe can be made of more than one series or we can say that a dataframe is a collection of series that can be used to analyse the data.

In [18]:
#example series

import pandas as pd

teacher = ['sudh', 'krish', 'pwskills']

ds = pd.Series(teacher)

ds

0        sudh
1       krish
2    pwskills
dtype: object

In [22]:
#example dataframe

import pandas as pd

course = {'teacher':['sudh','krish']}

df = pd.DataFrame(course)

df

  teacher
0    sudh
1   krish

In [21]:
type(df)

pandas.core.frame.DataFrame

## Solution 5

some common functions you can use to manipulate data in a Pandas DataFrame are:

1. df.columns
2. df.head()
3. df.tail()
4. df.dtypes

In [27]:
#example
import pandas as pd

data = {'Name':['Alice','Bob','Claire','boy','girl'],'Age':[25,30,27,56,45],"Gender":['Female','Male','Female','Male','Female']}

df = pd.DataFrame(data)

df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female
3     boy   56    Male
4    girl   45  Female

In [28]:
df.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

In [29]:
df.tail(3)

     Name  Age  Gender
2  Claire   27  Female
3     boy   56    Male
4    girl   45  Female

In [30]:
df.head(2)

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

In [31]:
df.dtypes

Name      object
Age        int64
Gender    object
dtype: object

## Solution 6

Series:
Series are mutable, which means that you can change the value of an element in the series after it has been initialized but size-immutable.

DataFrames:
DataFrames are both value-mutable and size-mutable. This means that you can change values held within the DataFrame or add/delete columns to/from the DataFrame.

Panel:
this is Deprecated in pandas module

All pandas data structures are value-mutable (the values they contain can be altered) but not always size-mutable. The length of a Series cannot be changed, but, for example, columns can be inserted into a DataFrame.

In [36]:
## Solution 7


import pandas as pd

teachers = ['sudh','krish','navin','hitesh']

courses = ['DSM','DSM','JAVA','Webdev']

ds1 = pd.Series(teachers)

ds2 = pd.Series(courses)

data = {'teachers': ds1 ,'courses': ds2}

df = pd.DataFrame(data)

df

  teachers courses
0     sudh     DSM
1    krish     DSM
2    navin    JAVA
3   hitesh  Webdev

In [37]:
type(ds1)

pandas.core.series.Series

In [38]:
type(ds2)

pandas.core.series.Series

In [39]:
type(df)

pandas.core.frame.DataFrame

## THE END